tutorials/2WayCouplingOceanWave3D/basicTutorialwtProbesResultsWtPhiCoupled_180625/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  5 -0.4 0 )
    ( 23 -0.4 0 )
    (  5  0.2 0 )
    ( 23  0.2 0 )
                 
    (  5 -0.4 0.1 )
    ( 23 -0.4 0.1 )
    (  5  0.2 0.1 )
    ( 23  0.2 0.1 )                    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 357 60 1 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    wall bottom 
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (2 3 7 6)
    )
    
    empty frontBack
    (
        (0 1 3 2)
        (4 5 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
