tutorials/2WayCouplingOceanWave3D/basicTutorialwtProbesResultsWtPhiCoupled_180625/system/fvFiles/fvSchemes.30
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
//    default	cellLimited fourth 1;
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(alpha1)     Gauss linear;
}

divSchemes
{
//    default	    Gauss linear;
    div(rhoPhi,U)  Gauss limitedLinearV 1;
//    div(phi,gamma)  Gauss vanLeer;
//    div(rho*phi,U)  Gauss MUSCL;
    //div((muEff*dev(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,alpha)  Gauss MUSCL;
    div(phirb,alpha) Gauss interfaceCompression;
//    div(rhoPhi,U)   Gauss limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.water;
}

// ************************************************************************* //
